In [1]:
import pandas as pd
import numpy as np

## 1. Cleaning Main Dataset

This dataset was sourced from Kaggle (https://www.kaggle.com/datasets/arnabchaki/data-science-salaries-2023), and describes data science-related job titles and salaries.

In [2]:
df = pd.read_csv('data/ds_salaries.csv')
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

In [3]:
for col in df.columns:
    print(col, df[col].unique())

work_year [2023 2022 2020 2021]
experience_level ['SE' 'MI' 'EN' 'EX']
employment_type ['FT' 'CT' 'FL' 'PT']
job_title ['Principal Data Scientist' 'ML Engineer' 'Data Scientist'
 'Applied Scientist' 'Data Analyst' 'Data Modeler' 'Research Engineer'
 'Analytics Engineer' 'Business Intelligence Engineer'
 'Machine Learning Engineer' 'Data Strategist' 'Data Engineer'
 'Computer Vision Engineer' 'Data Quality Analyst'
 'Compliance Data Analyst' 'Data Architect'
 'Applied Machine Learning Engineer' 'AI Developer' 'Research Scientist'
 'Data Analytics Manager' 'Business Data Analyst' 'Applied Data Scientist'
 'Staff Data Analyst' 'ETL Engineer' 'Data DevOps Engineer' 'Head of Data'
 'Data Science Manager' 'Data Manager' 'Machine Learning Researcher'
 'Big Data Engineer' 'Data Specialist' 'Lead Data Analyst'
 'BI Data Engineer' 'Director of Data Science'
 'Machine Learning Scientist' 'MLOps Engineer' 'AI Scientist'
 'Autonomous Vehicle Technician' 'Applied Machine Learning Scientist'
 'Lead Data Scientist' 'Cloud Database Engineer' 'Financial Data Analyst'
 'Data Infrastructure Engineer' 'Software Data Engineer' 'AI Programmer'
 'Data Operations Engineer' 'BI Developer' 'Data Science Lead'
 'Deep Learning Researcher' 'BI Analyst' 'Data Science Consultant'
 'Data Analytics Specialist' 'Machine Learning Infrastructure Engineer'
 'BI Data Analyst' 'Head of Data Science' 'Insight Analyst'
 'Deep Learning Engineer' 'Machine Learning Software Engineer'
 'Big Data Architect' 'Product Data Analyst'
 'Computer Vision Software Engineer' 'Azure Data Engineer'
 'Marketing Data Engineer' 'Data Analytics Lead' 'Data Lead'
 'Data Science Engineer' 'Machine Learning Research Engineer'
 'NLP Engineer' 'Manager Data Management' 'Machine Learning Developer'
 '3D Computer Vision Researcher' 'Principal Machine Learning Engineer'
 'Data Analytics Engineer' 'Data Analytics Consultant'
 'Data Management Specialist' 'Data Science Tech Lead'
 'Data Scientist Lead' 'Cloud Data Engineer' 'Data Operations Analyst'
 'Marketing Data Analyst' 'Power BI Developer' 'Product Data Scientist'
 'Principal Data Architect' 'Machine Learning Manager'
 'Lead Machine Learning Engineer' 'ETL Developer' 'Cloud Data Architect'
 'Lead Data Engineer' 'Head of Machine Learning' 'Principal Data Analyst'
 'Principal Data Engineer' 'Staff Data Scientist' 'Finance Data Analyst']
salary [   80000    30000    25500   175000   120000   222200   136000   219000
   141000   147100    90700   130000   100000   213660   130760   170000
   150000   110000   275000   174000   230000   143200   225000   156400
   200000    90000    72000   253200   342810   184590   162500   105380
    64500  1650000   204620   110680   270703   221484   212750   185000
   262000   245000   275300   183500   218500   199098   203300   123600
   189110   139000   258750   231500   166000   172500   110500   238000
   176000   237000   201450   309400   159100   115000    81500   280000
   210000   280100   168100   193500   510000    65000   300000   185900
   129300   140000    45000    36000   105000    70000   163196   145885
   217000   202800   104300   145000   165000   132300   179170    94300
   152500   116450   247300   133800   203000   133000   220000    54000
   289800   214000   179820   143860   283200   188800   214200   252000
   129000   155000   161800   141600   342300   176100    85000   138784
    83270    75000   204500   138900   318300   212200    95000   195000
   160000  1700000    38000    35000   168400   105200   190000   241000
    55000    15000    47500   250000   228000   186000   180000    50000
   205000   215000   247500   172200   224000  1400000   128000   329500
   269600   203500   152000   239000   122900   191765   134236   112000
    84000   135000   105500   293000   148500   240500   123700   152900
   117100   173000   113000   260000   184000   149500   127075   219535
   146115   199000   162000   221000   153000   187000   179000   109000
   142000   198800   125000    86000   106000   280700   150450   250500
   159500   130001    71907    93918    51962   257000   147000   222000
   133200   156000   304000   161200    84570   240000   183600   289076
   202353   157750   104650    68000    60000   181000   154000   146000
    64200    56100   208450   170550   171250   113750   153600   100500
   182500   121500   203100   114500    92700    61800   258000   167500
   106500    57000   286000   207000   223250   178600   353200   249300
   297300   198200   151800   317070   170730    20000   108000   134000
   124000   124500   148700   125600   120250   183000  1500000   216000
   143865   115092   132000   208049   128500   149600   102000   106800
   151000     7000    40000   143000    42000   111000   265000   235000
    60400   164000    56000    83500    52500   201036   134024    62000
    58000   172000   163800   126000   139500   109400   205600   105700
   239748   159832   186300   102500   149040   113900   172600   107900
   180180   106020   376080   213120   206500   121600   194500   115500
   115934    81666   206000   138000    92000    48000    87000   299500
   245100   115100    73900   141288    94192   210914   116704   185700
   169000   110600   193000   136850   276000   178500   161000    83300
   112700   128750   106250   188500   117000   104500   127000    94000
   210550   153300   161500   119500   148750   146300   153400   122700
   123900   340000   121700   310000   149076    82365    85500    97750
   201000   122000   116990    82920   142200   205920   171600    78000
   116000    36050    34320    93800    67000  1300000  1000000   104000
   152380   121904   128280   106900   192000   170500    60027    44737
   131899   104891   124740    65488    72200    64980   179975    86466
   168000   167580    87980   202000   148000   269000   158000   197000
   290000   172800   300240   200160   370000   137500   323300   184700
   153088   183310   144000    66000   126277   126500   272000   259000
   101400   288000   215050   198000   114000   209300   182200   227000
    52000   226700   133300   124999   800000    63000   253750   169200
   213580   163625    12000   375000  1350000   231250   138750   284310
   153090   225900   385000    93919   241871   133832   192500   216100
   140800   284000   236000   248100   145900   155850   102544   151410
   115360  1050000    25000   107000    23000   182750   314100   195800
   350000   262500   209450   158677   103200    61200    59000   174500
   107250   119000   285800   154600  5000000   124234    74540    79000
   141290    74178   107500  1060000     6000  1440000   840000  1250000
   182000   234100   223800   172100   232200   167200   291500   196200
   150900   167000    96100   196000   126100   187500    24000   165750
    89700    55250   175308   100706   229000  4000000   272550    64000
   143100   180560   115440  1125000   261500   134500  1100000    94500
   127500    51000   248400  4460000   149000   246000    10000  2500000
  2800000   249500   149850   122500   102640    66100   122600   159000
   255000   166700   194000   129400    89200   178750   197430   134760
    99000   105120    75360   171000    13000   213000   227200    61000
   243000   178000    96000   137000   189750   140250   191200   179500
    26000   118000   177000   131000   193750   116250   208000    45555
  6600000   140700    33000   154560   123648   177500   192564   144854
   179305   142127   315000   243900   156600    77300    45600   184100
   198440    47000   187200   116100   159699   138938    76000   125404
   123000    92250    97000   157000   345600   230400   175950   130050
   236600    27000   400000     8000   123400    88100   139600    85700
    98200    98000   144200  3000000   188700   160395   191475   141525
   156868   178800   132100   229998   154545    99750    68400   236900
   159200   243225   179775   218000   145300   195400   131300   195700
   130500   141300   102100    83000  1800000   633000   179400   193900
   222640   182160   297500    93000    73000    40300   136994   101570
    97500   212800   142800   500000   130240    83376    65004    84958
    66822    81000    46000   204100   136100     7500    77000    28500
   119300   146200   124270   185800   137400   148800  7500000    82000
    32400   216200   144100   175100   189650   164996    99450   188100
   139860   248700   167100   450000   189500   140100   177600   202900
   900000  4200000   260500    73400    49500  2400000   206699    99100
   221300    74000   249260   185400   128875    93700   136260   109280
   150075   110925    22800   112900    90320    62500   105400    43200
   215300   158200   209100   165400   132320   208775   147800  6000000
   100800   140400    82900    63900   112300   108800   242000   165220
   120160   124190   181940   220110   160080   106260   120600    84900
   136620    99360   161342   137141   211500   138600   192400    61300
    95550   136600   167875   205300   200100    70500   116150    99050
   192600   266400   150260    69000   324000   185100   104890    53000
    88000    66500   121000    29000    69999    52800   405000   380000
  8500000  7000000    38400    82500   700000     8760    51999    41000
    13400   103000   270000    45760    44000  2250000    37456 11000000
    14000  2200000   188000  2100000    51400    61500   720000    31000
    91000  1600000   256000    72500    65720   111775    93150    21600
  4900000  1200000    21000  1799997     9272   120500    21844    22000
    76760  1672000   420000 30400000    32000   416000    40900  4450000
   423000   325000    34000    69600   435000    37000    19000    18000
    39600  1335000  1450000   190200   138350   130800   412000]
salary_currency ['EUR' 'USD' 'INR' 'HKD' 'CHF' 'GBP' 'AUD' 'SGD' 'CAD' 'ILS' 'BRL' 'THB'
 'PLN' 'HUF' 'CZK' 'DKK' 'JPY' 'MXN' 'TRY' 'CLP']
salary_in_usd [ 85847  30000  25500 ...  28369 412000  94665]
employee_residence ['ES' 'US' 'CA' 'DE' 'GB' 'NG' 'IN' 'HK' 'PT' 'NL' 'CH' 'CF' 'FR' 'AU'
 'FI' 'UA' 'IE' 'IL' 'GH' 'AT' 'CO' 'SG' 'SE' 'SI' 'MX' 'UZ' 'BR' 'TH'
 'HR' 'PL' 'KW' 'VN' 'CY' 'AR' 'AM' 'BA' 'KE' 'GR' 'MK' 'LV' 'RO' 'PK'
 'IT' 'MA' 'LT' 'BE' 'AS' 'IR' 'HU' 'SK' 'CN' 'CZ' 'CR' 'TR' 'CL' 'PR'
 'DK' 'BO' 'PH' 'DO' 'EG' 'ID' 'AE' 'MY' 'JP' 'EE' 'HN' 'TN' 'RU' 'DZ'
 'IQ' 'BG' 'JE' 'RS' 'NZ' 'MD' 'LU' 'MT']
remote_ratio [100   0  50]
company_location ['ES' 'US' 'CA' 'DE' 'GB' 'NG' 'IN' 'HK' 'NL' 'CH' 'CF' 'FR' 'FI' 'UA'
 'IE' 'IL' 'GH' 'CO' 'SG' 'AU' 'SE' 'SI' 'MX' 'BR' 'PT' 'RU' 'TH' 'HR'
 'VN' 'EE' 'AM' 'BA' 'KE' 'GR' 'MK' 'LV' 'RO' 'PK' 'IT' 'MA' 'PL' 'AL'
 'AR' 'LT' 'AS' 'CR' 'IR' 'BS' 'HU' 'AT' 'SK' 'CZ' 'TR' 'PR' 'DK' 'BO'
 'PH' 'BE' 'ID' 'EG' 'AE' 'LU' 'MY' 'HN' 'JP' 'DZ' 'IQ' 'CN' 'NZ' 'CL'
 'MD' 'MT']
company_size ['L' 'S' 'M']

This dataset looks pretty clean, so we don't need to do any pre-cleaning before importing its data into our SQL program. Awesome!

However, we will need to add an 'id' column as a unique primary key column.

In [4]:
df.index.names = ['id']
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
id,,,,,,,,,,,
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

In [5]:
# exporting as CSV, so we can read the cleaned CSV into SQL
df.to_csv('data/ds_salaries_fixed.csv')

Finally, we see that three columns (employee_residence, company_location, salary_currency) have country/currency codes, and it would be nice to have more info on these codes. We will add these as secondary joining tables in our SQL program to get a more complete picture of the data.

## 2. Cleaning Secondary Dataset (ISO 3166 Codes)

We want more information on the country codes in the (employee_residence, company_location) columns of the main dataset. The main dataset metadata indicates that these columns use ISO 3166 codes, so I found a dataset for ISO 3166 codes (https://github.com/lukes/ISO-3166-Countries-with-Regional-Codes/blob/master/all/all.csv). Now we need to examine and clean the data before importing it into our SQL program as a table. We will be joining our main dataset and this dataset on the country code columns.

In [6]:
iso3166 = pd.read_csv('data/iso_3166.csv')
iso3166.head()

,name,alpha-2,alpha-3,country-code,iso_3166-2,region,sub-region,intermediate-region,region-code,sub-region-code,intermediate-region-code
0,Afghanistan,AF,AFG,4,ISO 3166-2:AF,Asia,Southern Asia,NaN,142.0,34.0,NaN
1,Åland Islands,AX,ALA,248,ISO 3166-2:AX,Europe,Northern Europe,NaN,150.0,154.0,NaN
2,Albania,AL,ALB,8,ISO 3166-2:AL,Europe,Southern Europe,NaN,150.0,39.0,NaN
3,Algeria,DZ,DZA,12,ISO 3166-2:DZ,Africa,Northern Africa,NaN,2.0,15.0,NaN
4,American Samoa,AS,ASM,16,ISO 3166-2:AS,Oceania,Polynesia,NaN,9.0,61.0,NaN

We see that the column headers have '-' between words. This is a non-standard format, and SQL will throw errors when we try to ingest this data as-is. We need to replace the '-' with an underscore.

In [7]:
iso3166.columns =  iso3166.columns.str.replace('-','_')
iso3166.head(2)

,name,alpha_2,alpha_3,country_code,iso_3166_2,region,sub_region,intermediate_region,region_code,sub_region_code,intermediate_region_code
0,Afghanistan,AF,AFG,4,ISO 3166-2:AF,Asia,Southern Asia,NaN,142.0,34.0,NaN
1,Åland Islands,AX,ALA,248,ISO 3166-2:AX,Europe,Northern Europe,NaN,150.0,154.0,NaN

Now let's check for data types, so that when creating the table in SQL, we specify the correct data type.

In [8]:
iso3166.dtypes

name                         object
alpha_2                      object
alpha_3                      object
country_code                  int64
iso_3166_2                   object
region                       object
sub_region                   object
intermediate_region          object
region_code                 float64
sub_region_code             float64
intermediate_region_code    float64
dtype: object

Examining the raw data a little more, we see that ('country_code','region_code','sub_region_code','intermediate_region_code') columns should be int rather than float. Let's convert those!

In [9]:
for col in ['country_code','region_code','sub_region_code','intermediate_region_code']:
    iso3166[col] = iso3166[col].fillna(0.0).astype(int)
iso3166.head()

,name,alpha_2,alpha_3,country_code,iso_3166_2,region,sub_region,intermediate_region,region_code,sub_region_code,intermediate_region_code
0,Afghanistan,AF,AFG,4,ISO 3166-2:AF,Asia,Southern Asia,NaN,142,34,0
1,Åland Islands,AX,ALA,248,ISO 3166-2:AX,Europe,Northern Europe,NaN,150,154,0
2,Albania,AL,ALB,8,ISO 3166-2:AL,Europe,Southern Europe,NaN,150,39,0
3,Algeria,DZ,DZA,12,ISO 3166-2:DZ,Africa,Northern Africa,NaN,2,15,0
4,American Samoa,AS,ASM,16,ISO 3166-2:AS,Oceania,Polynesia,NaN,9,61,0

In [10]:
iso3166.iloc[153]

name                                   Namibia
alpha_2                                    NaN
alpha_3                                    NAM
country_code                               516
iso_3166_2                       ISO 3166-2:NA
region                                  Africa
sub_region                  Sub-Saharan Africa
intermediate_region            Southern Africa
region_code                                  2
sub_region_code                            202
intermediate_region_code                    18
Name: 153, dtype: object

In [11]:
iso3166['alpha_2'][153] = 'NA'

/var/folders/n9/3mjn__fd1xd66lc1zh9nlj0h0000gp/T/ipykernel_33206/2393023246.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iso3166['alpha_2'][153] = 'NA'

In [12]:
# final data type check
iso3166.dtypes

name                        object
alpha_2                     object
alpha_3                     object
country_code                 int64
iso_3166_2                  object
region                      object
sub_region                  object
intermediate_region         object
region_code                  int64
sub_region_code              int64
intermediate_region_code     int64
dtype: object

One more thing - we want to check if our column of interest (alpha_2) is unique or not. Since the column has country codes for each country, we shouldn't expect duplicates, but just to be sure, we will check.

In [13]:
len(iso3166) == len(iso3166['alpha_2'].unique())

True

In [14]:
# exporting as CSV, so we can read the cleaned CSV into SQL
iso3166.to_csv('data/iso_3166_fixed.csv')

## 3. Cleaning Secondary Dataset (ISO 4217 Codes)

We want more information on the country codes in the (salary_currency) column of the main dataset. The main dataset metadata indicates that these columns use ISO 4217 codes, so I found a dataset for ISO 4217 codes (https://datahub.io/core/currency-codes). Now we need to examine and clean the data before importing it into our SQL program as a table. We will be joining our main dataset and this dataset on the currency code columns.

In [15]:
iso4217 = pd.read_csv('data/iso_4217.csv')
iso4217.head()

,Entity,Currency,AlphabeticCode,NumericCode,MinorUnit,WithdrawalDate
0,AFGHANISTAN,Afghani,AFN,971.0,2,NaN
1,ÅLAND ISLANDS,Euro,EUR,978.0,2,NaN
2,ALBANIA,Lek,ALL,8.0,2,NaN
3,ALGERIA,Algerian Dinar,DZD,12.0,2,NaN
4,AMERICAN SAMOA,US Dollar,USD,840.0,2,NaN

In [16]:
for col in iso4217.columns:
    print(col, iso4217[col].unique())

Entity ['AFGHANISTAN' 'ÅLAND ISLANDS' 'ALBANIA' 'ALGERIA' 'AMERICAN SAMOA'
 'ANDORRA' 'ANGOLA' 'ANGUILLA' 'ANTARCTICA' 'ANTIGUA AND BARBUDA'
 'ARGENTINA' 'ARMENIA' 'ARUBA' 'AUSTRALIA' 'AUSTRIA' 'AZERBAIJAN'
 'BAHAMAS (THE)' 'BAHRAIN' 'BANGLADESH' 'BARBADOS' 'BELARUS' 'BELGIUM'
 'BELIZE' 'BENIN' 'BERMUDA' 'BHUTAN' 'BOLIVIA (PLURINATIONAL STATE OF)'
 'BONAIRE, SINT EUSTATIUS AND SABA' 'BOSNIA AND HERZEGOVINA' 'BOTSWANA'
 'BOUVET ISLAND' 'BRAZIL' 'BRITISH INDIAN OCEAN TERRITORY (THE)'
 'BRUNEI DARUSSALAM' 'BULGARIA' 'BURKINA FASO' 'BURUNDI' 'CABO VERDE'
 'CAMBODIA' 'CAMEROON' 'CANADA' 'CAYMAN ISLANDS (THE)'
 'CENTRAL AFRICAN REPUBLIC (THE)' 'CHAD' 'CHILE' 'CHINA'
 'CHRISTMAS ISLAND' 'COCOS (KEELING) ISLANDS (THE)' 'COLOMBIA'
 'COMOROS (THE)' 'CONGO (THE DEMOCRATIC REPUBLIC OF THE)' 'CONGO (THE)'
 'COOK ISLANDS (THE)' 'COSTA RICA' "CÔTE D'IVOIRE" 'CROATIA' 'CUBA'
 'CURAÇAO' 'CYPRUS' 'CZECHIA' 'DENMARK' 'DJIBOUTI' 'DOMINICA'
 'DOMINICAN REPUBLIC (THE)' 'ECUADOR' 'EGYPT' 'EL SALVADOR'
 'EQUATORIAL GUINEA' 'ERITREA' 'ESTONIA' 'ESWATINI' 'ETHIOPIA'
 'EUROPEAN UNION' 'FALKLAND ISLANDS (THE) [MALVINAS]'
 'FAROE ISLANDS (THE)' 'FIJI' 'FINLAND' 'FRANCE' 'FRENCH GUIANA'
 'FRENCH POLYNESIA' 'FRENCH SOUTHERN TERRITORIES (THE)' 'GABON'
 'GAMBIA (THE)' 'GEORGIA' 'GERMANY' 'GHANA' 'GIBRALTAR' 'GREECE'
 'GREENLAND' 'GRENADA' 'GUADELOUPE' 'GUAM' 'GUATEMALA' 'GUERNSEY' 'GUINEA'
 'GUINEA-BISSAU' 'GUYANA' 'HAITI' 'HEARD ISLAND AND McDONALD ISLANDS'
 'HOLY SEE (THE)' 'HONDURAS' 'HONG KONG' 'HUNGARY' 'ICELAND' 'INDIA'
 'INDONESIA' 'INTERNATIONAL MONETARY FUND (IMF)'
 'IRAN (ISLAMIC REPUBLIC OF)' 'IRAQ' 'IRELAND' 'ISLE OF MAN' 'ISRAEL'
 'ITALY' 'JAMAICA' 'JAPAN' 'JERSEY' 'JORDAN' 'KAZAKHSTAN' 'KENYA'
 'KIRIBATI' "KOREA (THE DEMOCRATIC PEOPLE'S REPUBLIC OF)"
 'KOREA (THE REPUBLIC OF)' 'KUWAIT' 'KYRGYZSTAN'
 "LAO PEOPLE'S DEMOCRATIC REPUBLIC (THE)" 'LATVIA' 'LEBANON' 'LESOTHO'
 'LIBERIA' 'LIBYA' 'LIECHTENSTEIN' 'LITHUANIA' 'LUXEMBOURG' 'MACAO'
 'NORTH MACEDONIA' 'MADAGASCAR' 'MALAWI' 'MALAYSIA' 'MALDIVES' 'MALI'
 'MALTA' 'MARSHALL ISLANDS (THE)' 'MARTINIQUE' 'MAURITANIA' 'MAURITIUS'
 'MAYOTTE' 'MEMBER COUNTRIES OF THE AFRICAN DEVELOPMENT BANK GROUP'
 'MEXICO' 'MICRONESIA (FEDERATED STATES OF)' 'MOLDOVA (THE REPUBLIC OF)'
 'MONACO' 'MONGOLIA' 'MONTENEGRO' 'MONTSERRAT' 'MOROCCO' 'MOZAMBIQUE'
 'MYANMAR' 'NAMIBIA' 'NAURU' 'NEPAL' 'NETHERLANDS (THE)' 'NEW CALEDONIA'
 'NEW ZEALAND' 'NICARAGUA' 'NIGER (THE)' 'NIGERIA' 'NIUE' 'NORFOLK ISLAND'
 'NORTHERN MARIANA ISLANDS (THE)' 'NORWAY' 'OMAN' 'PAKISTAN' 'PALAU'
 'PALESTINE, STATE OF' 'PANAMA' 'PAPUA NEW GUINEA' 'PARAGUAY' 'PERU'
 'PHILIPPINES (THE)' 'PITCAIRN' 'POLAND' 'PORTUGAL' 'PUERTO RICO' 'QATAR'
 'RÉUNION' 'ROMANIA' 'RUSSIAN FEDERATION (THE)' 'RWANDA'
 'SAINT BARTHÉLEMY' 'SAINT HELENA, ASCENSION AND TRISTAN DA CUNHA'
 'SAINT KITTS AND NEVIS' 'SAINT LUCIA' 'SAINT MARTIN (FRENCH PART)'
 'SAINT PIERRE AND MIQUELON' 'SAINT VINCENT AND THE GRENADINES' 'SAMOA'
 'SAN MARINO' 'SAO TOME AND PRINCIPE' 'SAUDI ARABIA' 'SENEGAL' 'SERBIA'
 'SEYCHELLES' 'SIERRA LEONE' 'SINGAPORE' 'SINT MAARTEN (DUTCH PART)'
 'SISTEMA UNITARIO DE COMPENSACION REGIONAL DE PAGOS "SUCRE"' 'SLOVAKIA'
 'SLOVENIA' 'SOLOMON ISLANDS' 'SOMALIA' 'SOUTH AFRICA'
 'SOUTH GEORGIA AND THE SOUTH SANDWICH ISLANDS' 'SOUTH SUDAN' 'SPAIN'
 'SRI LANKA' 'SUDAN (THE)' 'SURINAME' 'SVALBARD AND JAN MAYEN' 'SWEDEN'
 'SWITZERLAND' 'SYRIAN ARAB REPUBLIC' 'TAIWAN (PROVINCE OF CHINA)'
 'TAJIKISTAN' 'TANZANIA, UNITED REPUBLIC OF' 'THAILAND' 'TIMOR-LESTE'
 'TOGO' 'TOKELAU' 'TONGA' 'TRINIDAD AND TOBAGO' 'TUNISIA' 'TURKEY'
 'TURKMENISTAN' 'TURKS AND CAICOS ISLANDS (THE)' 'TUVALU' 'UGANDA'
 'UKRAINE' 'UNITED ARAB EMIRATES (THE)'
 'UNITED KINGDOM OF GREAT BRITAIN AND NORTHERN IRELAND (THE)'
 'UNITED STATES MINOR OUTLYING ISLANDS (THE)'
 'UNITED STATES OF AMERICA (THE)' 'URUGUAY' 'UZBEKISTAN' 'VANUATU'
 'VENEZUELA (BOLIVARIAN REPUBLIC OF)' 'VIET NAM'
 'VIRGIN ISLANDS (BRITISH)' 'VIRGIN ISLANDS (U.S.)' 'WALLIS AND FUTUNA'
 'WESTERN SAHARA' 'YEMEN' 'ZAMBIA' 'ZIMBABWE'
 'ZZ01_Bond Markets Unit European_EURCO'
 'ZZ02_Bond Markets Unit European_EMU-6'
 'ZZ03_Bond Markets Unit European_EUA-9'
 'ZZ04_Bond Markets Unit European_EUA-17' 'ZZ06_Testing_Code'
 'ZZ07_No_Currency' 'ZZ08_Gold' 'ZZ09_Palladium' 'ZZ10_Platinum'
 'ZZ11_Silver' 'BOLIVIA' 'BURMA' 'CZECHOSLOVAKIA'
 'EUROPEAN MONETARY CO-OPERATION FUND (EMCF)'
 'FRENCH SOUTHERN TERRITORIES' 'GERMAN DEMOCRATIC REPUBLIC'
 'HOLY SEE (VATICAN CITY STATE)' 'LAO' 'MOLDOVA, REPUBLIC OF'
 'NETHERLANDS' 'NETHERLANDS ANTILLES' 'RUSSIAN FEDERATION' 'SAINT MARTIN'
 'SAINT-BARTHÉLEMY' 'SERBIA AND MONTENEGRO' 'SOUTHERN RHODESIA' 'SUDAN'
 'SWAZILAND' 'UNION OF SOVIET SOCIALIST REPUBLICS' 'UNITED STATES'
 'VENEZUELA' 'VIETNAM' 'YEMEN, DEMOCRATIC' 'YUGOSLAVIA' 'ZAIRE'
 'ZZ01_Gold-Franc' 'ZZ02_RINET Funds Code' 'ZZ05_UIC-Franc']
Currency ['Afghani' 'Euro' 'Lek' 'Algerian Dinar' 'US Dollar' 'Kwanza'
 'East Caribbean Dollar' 'No universal currency' 'Argentine Peso'
 'Armenian Dram' 'Aruban Florin' 'Australian Dollar' 'Azerbaijan Manat'
 'Bahamian Dollar' 'Bahraini Dinar' 'Taka' 'Barbados Dollar'
 'Belarusian Ruble' 'Belize Dollar' 'CFA Franc BCEAO' 'Bermudian Dollar'
 'Indian Rupee' 'Ngultrum' 'Boliviano' 'Mvdol' 'Convertible Mark' 'Pula'
 'Norwegian Krone' 'Brazilian Real' 'Brunei Dollar' 'Bulgarian Lev'
 'Burundi Franc' 'Cabo Verde Escudo' 'Riel' 'CFA Franc BEAC'
 'Canadian Dollar' 'Cayman Islands Dollar' 'Chilean Peso'
 'Unidad de Fomento' 'Yuan Renminbi' 'Colombian Peso'
 'Unidad de Valor Real' 'Comorian Franc' 'Congolese Franc'
 'New Zealand Dollar' 'Costa Rican Colon' 'Kuna' 'Cuban Peso'
 'Peso Convertible' 'Netherlands Antillean Guilder' 'Czech Koruna'
 'Danish Krone' 'Djibouti Franc' 'Dominican Peso' 'Egyptian Pound'
 'El Salvador Colon' 'Nakfa' 'Lilangeni' 'Ethiopian Birr'
 'Falkland Islands Pound' 'Fiji Dollar' 'CFP Franc' 'Dalasi' 'Lari'
 'Ghana Cedi' 'Gibraltar Pound' 'Quetzal' 'Pound Sterling' 'Guinean Franc'
 'Guyana Dollar' 'Gourde' 'Lempira' 'Hong Kong Dollar' 'Forint'
 'Iceland Krona' 'Rupiah' 'SDR (Special Drawing Right)' 'Iranian Rial'
 'Iraqi Dinar' 'New Israeli Sheqel' 'Jamaican Dollar' 'Yen'
 'Jordanian Dinar' 'Tenge' 'Kenyan Shilling' 'North Korean Won' 'Won'
 'Kuwaiti Dinar' 'Som' 'Lao Kip' 'Lebanese Pound' 'Loti' 'Rand'
 'Liberian Dollar' 'Libyan Dinar' 'Swiss Franc' 'Pataca' 'Denar'
 'Malagasy Ariary' 'Malawi Kwacha' 'Malaysian Ringgit' 'Rufiyaa' 'Ouguiya'
 'Mauritius Rupee' 'ADB Unit of Account' 'Mexican Peso'
 'Mexican Unidad de Inversion (UDI)' 'Moldovan Leu' 'Tugrik'
 'Moroccan Dirham' 'Mozambique Metical' 'Kyat' 'Namibia Dollar'
 'Nepalese Rupee' 'Cordoba Oro' 'Naira' 'Rial Omani' 'Pakistan Rupee'
 'Balboa' 'Kina' 'Guarani' 'Sol' 'Philippine Peso' 'Zloty' 'Qatari Rial'
 'Romanian Leu' 'Russian Ruble' 'Rwanda Franc' 'Saint Helena Pound' 'Tala'
 'Dobra' 'Saudi Riyal' 'Serbian Dinar' 'Seychelles Rupee' 'Leone'
 'Singapore Dollar' 'Sucre' 'Solomon Islands Dollar' 'Somali Shilling'
 'South Sudanese Pound' 'Sri Lanka Rupee' 'Sudanese Pound'
 'Surinam Dollar' 'Swedish Krona' 'WIR Euro' 'WIR Franc' 'Syrian Pound'
 'New Taiwan Dollar' 'Somoni' 'Tanzanian Shilling' 'Baht' "Pa'anga"
 'Trinidad and Tobago Dollar' 'Tunisian Dinar' 'Turkish Lira'
 'Turkmenistan New Manat' 'Uganda Shilling' 'Hryvnia' 'UAE Dirham'
 'US Dollar (Next day)' 'Peso Uruguayo'
 'Uruguay Peso en Unidades Indexadas (UI)' 'Unidad Previsional'
 'Uzbekistan Sum' 'Vatu' 'Bolívar Soberano' 'Dong' 'Yemeni Rial'
 'Zambian Kwacha' 'Zimbabwe Dollar'
 'Bond Markets Unit European Composite Unit (EURCO)'
 'Bond Markets Unit European Monetary Unit (E.M.U.-6)'
 'Bond Markets Unit European Unit of Account 9 (E.U.A.-9)'
 'Bond Markets Unit European Unit of Account 17 (E.U.A.-17)'
 'Codes specifically reserved for testing purposes'
 'The codes assigned for transactions where no currency is involved'
 'Gold' 'Palladium' 'Platinum' 'Silver' 'Markka' 'Old Lek'
 'Andorran Peseta' 'Spanish Peseta' 'French Franc' 'New Kwanza'
 'Kwanza Reajustado' 'Austral' 'Peso Argentino' 'Peso' 'Schilling'
 'Azerbaijanian Manat' 'Convertible Franc' 'Belgian Franc'
 'Financial Franc' 'Peso boliviano' 'Dinar' 'Cruzeiro' 'Cruzado'
 'New Cruzado' 'Cruzeiro Real' 'Lev A/52' 'Lev A/62' 'Lev'
 'Croatian Dinar' 'Croatian Kuna' 'Cyprus Pound' 'Krona A/53' 'Koruna'
 'Unidad de Valor Constante (UVC)' 'Ekwele' 'Kroon'
 'European Currency Unit (E.C.U)' 'Georgian Coupon' 'Mark der DDR'
 'Deutsche Mark' 'Cedi' 'Drachma' 'Syli' 'Guinea Escudo'
 'Guinea-Bissau Peso' 'Italian Lira' 'Old Krona' 'Irish Pound' 'Pound'
 'Old Shekel' 'Pathet Lao Kip' 'Latvian Lats' 'Latvian Ruble'
 'Financial Rand' 'Lithuanian Litas' 'Talonas'
 'Luxembourg Convertible Franc' 'Luxembourg Franc'
 'Luxembourg Financial Franc' 'Malagasy Franc' 'Kwacha' 'Maldive Rupee'
 'Mali Franc' 'Maltese Lira' 'Maltese Pound' 'Mozambique Escudo'
 'Netherlands Guilder' 'Cordoba' 'Inti' 'Nuevo Sol' 'Portuguese Escudo'
 'Leu A/52' 'Old Leu' 'New Romanian Leu' 'Slovak Koruna' 'Tolar'
 'Rhodesian Dollar' '"A" Account (convertible Peseta Account)'
 'Sudanese Dinar' 'Surinam Guilder' 'WIR Franc (for electronic)'
 'Tajik Ruble' 'Timor Escudo' 'Old Turkish Lira' 'New Turkish Lira'
 'Turkmenistan Manat' 'Old Shilling' 'Karbovanet' 'Rouble'
 'US Dollar (Same day)' 'Old Uruguay Peso' 'Uruguayan Peso' 'Bolivar'
 'Bolivar Fuerte' 'Bolívar' 'Old Dong' 'Yemeni Dinar'
 'New Yugoslavian Dinar' 'New Dinar' 'Yugoslavian Dinar' 'New Zaire'
 'Zaire' 'Zimbabwe Dollar (old)' 'Zimbabwe Dollar (new)' 'Gold-Franc'
 'RINET Funds Code' 'UIC-Franc']
AlphabeticCode ['AFN' 'EUR' 'ALL' 'DZD' 'USD' 'AOA' 'XCD' nan 'ARS' 'AMD' 'AWG' 'AUD'
 'AZN' 'BSD' 'BHD' 'BDT' 'BBD' 'BYN' 'BZD' 'XOF' 'BMD' 'INR' 'BTN' 'BOB'
 'BOV' 'BAM' 'BWP' 'NOK' 'BRL' 'BND' 'BGN' 'BIF' 'CVE' 'KHR' 'XAF' 'CAD'
 'KYD' 'CLP' 'CLF' 'CNY' 'COP' 'COU' 'KMF' 'CDF' 'NZD' 'CRC' 'HRK' 'CUP'
 'CUC' 'ANG' 'CZK' 'DKK' 'DJF' 'DOP' 'EGP' 'SVC' 'ERN' 'SZL' 'ETB' 'FKP'
 'FJD' 'XPF' 'GMD' 'GEL' 'GHS' 'GIP' 'GTQ' 'GBP' 'GNF' 'GYD' 'HTG' 'HNL'
 'HKD' 'HUF' 'ISK' 'IDR' 'XDR' 'IRR' 'IQD' 'ILS' 'JMD' 'JPY' 'JOD' 'KZT'
 'KES' 'KPW' 'KRW' 'KWD' 'KGS' 'LAK' 'LBP' 'LSL' 'ZAR' 'LRD' 'LYD' 'CHF'
 'MOP' 'MKD' 'MGA' 'MWK' 'MYR' 'MVR' 'MRU' 'MUR' 'XUA' 'MXN' 'MXV' 'MDL'
 'MNT' 'MAD' 'MZN' 'MMK' 'NAD' 'NPR' 'NIO' 'NGN' 'OMR' 'PKR' 'PAB' 'PGK'
 'PYG' 'PEN' 'PHP' 'PLN' 'QAR' 'RON' 'RUB' 'RWF' 'SHP' 'WST' 'STN' 'SAR'
 'RSD' 'SCR' 'SLL' 'SGD' 'XSU' 'SBD' 'SOS' 'SSP' 'LKR' 'SDG' 'SRD' 'SEK'
 'CHE' 'CHW' 'SYP' 'TWD' 'TJS' 'TZS' 'THB' 'TOP' 'TTD' 'TND' 'TRY' 'TMT'
 'UGX' 'UAH' 'AED' 'USN' 'UYU' 'UYI' 'UYW' 'UZS' 'VUV' 'VES' 'VND' 'YER'
 'ZMW' 'ZWL' 'XBA' 'XBB' 'XBC' 'XBD' 'XTS' 'XXX' 'XAU' 'XPD' 'XPT' 'XAG'
 'AFA' 'FIM' 'ALK' 'ADP' 'ESP' 'FRF' 'AOK' 'AON' 'AOR' 'ARA' 'ARP' 'ARY'
 'RUR' 'ATS' 'AYM' 'AZM' 'BYB' 'BYR' 'BEC' 'BEF' 'BEL' 'BOP' 'BAD' 'BRB'
 'BRC' 'BRE' 'BRN' 'BRR' 'BGJ' 'BGK' 'BGL' 'BUK' 'HRD' 'CYP' 'CSJ' 'CSK'
 'ECS' 'ECV' 'GQE' 'EEK' 'XEU' 'GEK' 'DDM' 'DEM' 'GHC' 'GHP' 'GRD' 'GNE'
 'GNS' 'GWE' 'GWP' 'ITL' 'ISJ' 'IEP' 'ILP' 'ILR' 'LAJ' 'LVL' 'LVR' 'LSM'
 'ZAL' 'LTL' 'LTT' 'LUC' 'LUF' 'LUL' 'MGF' 'MVQ' 'MLF' 'MTL' 'MTP' 'MRO'
 'MXP' 'MZE' 'MZM' 'NLG' 'NIC' 'PEH' 'PEI' 'PES' 'PLZ' 'PTE' 'ROK' 'ROL'
 'STD' 'CSD' 'SKK' 'SIT' 'RHD' 'ESA' 'ESB' 'SDD' 'SDP' 'SRG' 'CHC' 'TJR'
 'TPE' 'TRL' 'TMM' 'UGS' 'UGW' 'UAK' 'SUR' 'USS' 'UYN' 'UYP' 'VEB' 'VEF'
 'VNC' 'YDD' 'YUD' 'YUM' 'YUN' 'ZRN' 'ZRZ' 'ZMK' 'ZWC' 'ZWD' 'ZWN' 'ZWR'
 'XFO' 'XRE' 'XFU']
NumericCode [971. 978.   8.  12. 840. 973. 951.  nan  32.  51. 533.  36. 944.  44.
  48.  50.  52. 933.  84. 952.  60. 356.  64.  68. 984. 977.  72. 578.
 986.  96. 975. 108. 132. 116. 950. 124. 136. 152. 990. 156. 170. 970.
 174. 976. 554. 188. 191. 192. 931. 532. 203. 208. 262. 214. 818. 222.
 232. 748. 230. 238. 242. 953. 270. 981. 936. 292. 320. 826. 324. 328.
 332. 340. 344. 348. 352. 360. 960. 364. 368. 376. 388. 392. 400. 398.
 404. 408. 410. 414. 417. 418. 422. 426. 710. 430. 434. 756. 446. 807.
 969. 454. 458. 462. 929. 480. 965. 484. 979. 498. 496. 504. 943. 104.
 516. 524. 558. 566. 512. 586. 590. 598. 600. 604. 608. 985. 634. 946.
 643. 646. 654. 882. 930. 682. 941. 690. 694. 702. 994.  90. 706. 728.
 144. 938. 968. 752. 947. 948. 760. 901. 972. 834. 764. 776. 780. 788.
 949. 934. 800. 980. 784. 997. 858. 940. 927. 860. 548. 928. 704. 886.
 967. 932. 955. 956. 957. 958. 963. 999. 959. 964. 962. 961.   4. 246.
  20. 724. 250.  24. 982. 810.  40. 945.  31. 112. 974. 993.  56. 992.
  70.  76. 987. 100. 196. 200. 218. 983. 226. 233. 954. 268. 278. 276.
 288. 939. 300. 624. 380. 372. 428. 991. 440. 989. 442. 988. 450. 466.
 470. 478. 508. 528. 616. 620. 642. 678. 891. 703. 705. 716. 996. 995.
 736. 740. 762. 626. 792. 795. 804. 998. 862. 937. 720. 890. 180. 894.
 942. 935.]
MinorUnit ['2' nan '3' '0' '4' '-']
WithdrawalDate [nan '2003-01' '2002-03' '1989-12' '2003-07' '1991-03' '2000-02' '1992-01'
 '1985-07' '1989 to 1990' '1994-08' '2005-10' '2005-12' '2001-01'
 '2017-01' '1994-06' '1990-03' '1987-02' '1998-07' '1986-03' '1989-02'
 '1993-03' '1994-07' '2003-11' '1990-02' '1995-01' '2015-06' '2008-01'
 '2000-09' '1986-06' '2011-01' '1999-01' '1995-10' '1994-04'
 '1990-07 to 1990-09' '2007-06' '1986-02' '1978 to 1981' '1997-05'
 '1994-05' '1993-01' '1979-12' '2014-01' '1994-12' '1985-05' '1995-03'
 '2014-12' '1993-07' '2004-12' '2016-02' '1984-11' '1983-06' '2017-12'
 '1993-12' '2006-06' '2010-10' '1990-10' '1991-07' '2015-12' '1997-01'
 '2005-06' '2004-01' '2006-10' '2009-01' '2007-01' '2012-09' '2007-07'
 '1998-06' '2003-12' '2018-08' '2004-11' '1995-05' '2001-04' '2002-07'
 '2002-11' '1993-10' '1987-05' '1996-09' '1990-12' '2014-03' '2011-12'
 '1989-1990' '1991-09' '1990-01' '1995-11' '1999-06' '1994-02' '2012-12'
 '2006-08' '2008-08' '2006-09' '2009-06' '1999-11' '2013-11']

Most of the columns and their data seem fine, but the column MinorUnit has strings of numbers, nan, and '-'. We will first replace the '-' with a 0, and then convert the data type to int.

In [17]:
iso4217['MinorUnit'] = iso4217['MinorUnit'].replace('-',0)

In [18]:
for col in ['NumericCode','MinorUnit']:
    iso4217[col] = iso4217[col].fillna(0.0).astype(int)
iso4217.head()

,Entity,Currency,AlphabeticCode,NumericCode,MinorUnit,WithdrawalDate
0,AFGHANISTAN,Afghani,AFN,971,2,NaN
1,ÅLAND ISLANDS,Euro,EUR,978,2,NaN
2,ALBANIA,Lek,ALL,8,2,NaN
3,ALGERIA,Algerian Dinar,DZD,12,2,NaN
4,AMERICAN SAMOA,US Dollar,USD,840,2,NaN

In [19]:
# doing final data type check
iso4217.dtypes

Entity            object
Currency          object
AlphabeticCode    object
NumericCode        int64
MinorUnit          int64
WithdrawalDate    object
dtype: object

In [20]:
len(iso4217) == len(iso4217['AlphabeticCode'].unique())

False

In [21]:
# exporting as CSV, so we can read the cleaned CSV into SQL
iso4217.to_csv('data/iso_4217_fixed.csv')